APITest1/Log/vtd_user.log

2021-09-02 05:51:07,921 [1] INFO  - Loaded appender: FileAppenderInternal
2021-09-02 05:51:07,931 [1] INFO  - Loaded appender: FileAppenderExternal
2021-09-02 05:51:07,931 [1] INFO  - Loaded appender: UserLoggerAppender
2021-09-02 05:51:07,933 [1] INFO  - Loaded appender: FileAppenderInternal
2021-09-02 05:51:07,934 [1] INFO  - Loaded appender: FileAppenderExternal
2021-09-02 05:51:07,934 [1] INFO  - Loaded appender: UserLoggerAppender
2021-09-02 05:51:08,447 [9] INFO  - Step 'Start' : Step 'Start' started
2021-09-02 05:51:08,492 [9] INFO  - Step 'Start' ended successfully
2021-09-02 05:51:08,496 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2021-09-02 05:51:08,500 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2021-09-02 05:51:08,511 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-09-02 05:51:08,527 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>London</ArrivalCity>
      <FlightDate>2021-09-15T16:00:00+00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-09-02 05:51:08,547 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-09-02 05:51:08,583 [9] INFO  - Returning the response to the previous channel
2021-09-02 05:51:08,587 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>London</ArrivalCity>
          <ArrivalTime>03:23 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:12 AM</DepartureTime>
          <FlightNumber>20253</FlightNumber>
          <Price>112.2</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>London</ArrivalCity>
          <ArrivalTime>05:23 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:12 AM</DepartureTime>
          <FlightNumber>20262</FlightNumber>
          <Price>112.2</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-09-02 05:51:08,606 [9] INFO  - Structural Validation: True
2021-09-02 05:51:08,611 [9] INFO  - Step 'GetFlights' ended successfully
2021-09-02 05:51:08,612 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-09-02 05:51:08,614 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Header />
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>First</Class>
        <CustomerName>usman</CustomerName>
        <DepartureDate>2021-09-15T00:00:00+00:00</DepartureDate>
        <FlightNumber>20262</FlightNumber>
        <NumberOfTickets>1</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-09-02 05:51:08,616 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-09-02 05:51:08,632 [9] INFO  - Returning the response to the previous channel
2021-09-02 05:51:08,634 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>97</OrderNumber>
        <TotalPrice>112.2</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-09-02 05:51:08,638 [9] INFO  - Structural Validation: True
2021-09-02 05:51:08,639 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-09-02 05:51:08,639 [9] INFO  - Step 'Iteration 1' ended successfully
2021-09-02 05:51:08,639 [9] INFO  - Step 'Test Flow' ended successfully
2021-09-02 05:51:08,639 [9] INFO  - Step 'End' : Step 'End' started
2021-09-02 05:51:08,639 [9] INFO  - Step 'End' ended successfully
